class PlayingField:
    def __init__(self, my_field_values, enemy_field_values):
        self.my_field_values = my_field_values
        self.enemy_field_values = enemy_field_values

    @property
    def output_screen(self):
        separator = "          "
        name_field = ["        Моё поле       ", separator, "    Поле противника    "]
        string_letters_table = ["А", "Б", "В", "Г", "Д", "Е", "Ж", "З", "И", "К"]
        string_numbers_table = "".join([
            "  ", "\u0332" + "1",
            " ", "\u0332" + "2",
            " ", "\u0332" + "3",
            " ", "\u0332" + "4",
            " ", "\u0332" + "5",
            " ", "\u0332" + "6",
            " ", "\u0332" + "7",
            " ", "\u0332" + "8",
            " ", "\u0332" + "9",
            " ", "\u0332" + "10"
        ])
        screen = [name_field, string_numbers_table + separator + string_numbers_table]
        for letter in string_letters_table:
            list_row = [
                letter,
                "|", "\u0332" + self.my_field_values[letter + "1"],
                "|", "\u0332" + self.my_field_values[letter + "2"],
                "|", "\u0332" + self.my_field_values[letter + "3"],
                "|", "\u0332" + self.my_field_values[letter + "4"],
                "|", "\u0332" + self.my_field_values[letter + "5"],
                "|", "\u0332" + self.my_field_values[letter + "6"],
                "|", "\u0332" + self.my_field_values[letter + "7"],
                "|", "\u0332" + self.my_field_values[letter + "8"],
                "|", "\u0332" + self.my_field_values[letter + "9"],
                "|", "\u0332" + self.my_field_values[letter + "10"],
                "|",
                separator,
                letter,
                "|", "\u0332" + self.enemy_field_values[letter + "1"],
                "|", "\u0332" + self.enemy_field_values[letter + "2"],
                "|", "\u0332" + self.enemy_field_values[letter + "3"],
                "|", "\u0332" + self.enemy_field_values[letter + "4"],
                "|", "\u0332" + self.enemy_field_values[letter + "5"],
                "|", "\u0332" + self.enemy_field_values[letter + "6"],
                "|", "\u0332" + self.enemy_field_values[letter + "7"],
                "|", "\u0332" + self.enemy_field_values[letter + "8"],
                "|", "\u0332" + self.enemy_field_values[letter + "9"],
                "|", "\u0332" + self.enemy_field_values[letter + "10"],
                "|"
            ]
            screen.append(list_row)
        for i in range(12):
            print("".join(screen[i]))


# Код игры
Value_PlayingField = PlayingField({
    "А1": " ", "А2": " ", "А3": " ", "А4": " ", "А5": " ",
    "А6": " ", "А7": " ", "А8": " ", "А9": " ", "А10": " ",
    "Б1": " ", "Б2": " ", "Б3": " ", "Б4": " ", "Б5": " ",
    "Б6": " ", "Б7": " ", "Б8": " ", "Б9": " ", "Б10": " ",
    "В1": " ", "В2": " ", "В3": " ", "В4": " ", "В5": " ",
    "В6": " ", "В7": " ", "В8": " ", "В9": " ", "В10": " ",
    "Г1": " ", "Г2": " ", "Г3": " ", "Г4": " ", "Г5": " ",
    "Г6": " ", "Г7": " ", "Г8": " ", "Г9": " ", "Г10": " ",
    "Д1": " ", "Д2": " ", "Д3": " ", "Д4": " ", "Д5": " ",
    "Д6": " ", "Д7": " ", "Д8": " ", "Д9": " ", "Д10": " ",
    "Е1": " ", "Е2": " ", "Е3": " ", "Е4": " ", "Е5": " ",
    "Е6": " ", "Е7": " ", "Е8": " ", "Е9": " ", "Е10": " ",
    "Ж1": " ", "Ж2": " ", "Ж3": " ", "Ж4": " ", "Ж5": " ",
    "Ж6": " ", "Ж7": " ", "Ж8": " ", "Ж9": " ", "Ж10": " ",
    "З1": " ", "З2": " ", "З3": " ", "З4": " ", "З5": " ",
    "З6": " ", "З7": " ", "З8": " ", "З9": " ", "З10": " ",
    "И1": " ", "И2": " ", "И3": " ", "И4": " ", "И5": " ",
    "И6": " ", "И7": " ", "И8": " ", "И9": " ", "И10": " ",
    "К1": " ", "К2": " ", "К3": " ", "К4": " ", "К5": " ",
    "К6": " ", "К7": " ", "К8": " ", "К9": " ", "К10": " "
    },
    {
    "А1": " ", "А2": " ", "А3": " ", "А4": " ", "А5": " ",
    "А6": " ", "А7": " ", "А8": " ", "А9": " ", "А10": " ",
    "Б1": " ", "Б2": " ", "Б3": " ", "Б4": " ", "Б5": " ",
    "Б6": " ", "Б7": " ", "Б8": " ", "Б9": " ", "Б10": " ",
    "В1": " ", "В2": " ", "В3": " ", "В4": " ", "В5": " ",
    "В6": " ", "В7": " ", "В8": " ", "В9": " ", "В10": " ",
    "Г1": " ", "Г2": " ", "Г3": " ", "Г4": " ", "Г5": " ",
    "Г6": " ", "Г7": " ", "Г8": " ", "Г9": " ", "Г10": " ",
    "Д1": " ", "Д2": " ", "Д3": " ", "Д4": " ", "Д5": " ",
    "Д6": " ", "Д7": " ", "Д8": " ", "Д9": " ", "Д10": " ",
    "Е1": " ", "Е2": " ", "Е3": " ", "Е4": " ", "Е5": " ",
    "Е6": " ", "Е7": " ", "Е8": " ", "Е9": " ", "Е10": " ",
    "Ж1": " ", "Ж2": " ", "Ж3": " ", "Ж4": " ", "Ж5": " ",
    "Ж6": " ", "Ж7": " ", "Ж8": " ", "Ж9": " ", "Ж10": " ",
    "З1": " ", "З2": " ", "З3": " ", "З4": " ", "З5": " ",
    "З6": " ", "З7": " ", "З8": " ", "З9": " ", "З10": " ",
    "И1": " ", "И2": " ", "И3": " ", "И4": " ", "И5": " ",
    "И6": " ", "И7": " ", "И8": " ", "И9": " ", "И10": " ",
    "К1": " ", "К2": " ", "К3": " ", "К4": " ", "К5": " ",
    "К6": " ", "К7": " ", "К8": " ", "К9": " ", "К10": " "
})

Value_PlayingField.output_screen
