import random

fleet = [[[{'А4': 'Х', 'А5': 'Х', 'А6': 'Х',
            'А7': 'Х'},
           {'А3': ' ', 'А8': ' ', 'Б3': ' ', 'Б4': ' ', 'Б5': ' ', 'Б6': ' ', 'Б7': ' ', 'Б8': ' '}]], [
             [{'К1': '\033[34m\u25A0\033[0m', 'К2': '\033[34m\u25A0\033[0m', 'К3': '\033[34m\u25A0\033[0m'},
              {'И1': ' ', 'И2': ' ', 'И3': ' ', 'И4': ' ', 'К4': ' '}],
             [{'З1': '\033[34m\u25A0\033[0m', 'З2': '\033[34m\u25A0\033[0m', 'З3': '\033[34m\u25A0\033[0m'},
              {'Ж1': ' ', 'Ж2': ' ', 'Ж3': ' ', 'Ж4': ' ', 'З4': ' ', 'И1': ' ', 'И2': ' ', 'И3': ' ', 'И4': ' '}]], [
             [{'В10': '\033[34m\u25A0\033[0m', 'Г10': '\033[34m\u25A0\033[0m'},
              {'Б9': ' ', 'В9': ' ', 'Г9': ' ', 'Д9': ' ', 'Б10': ' ', 'Д10': ' '}],
             [{'В1': '\033[34m\u25A0\033[0m', 'Г1': '\033[34m\u25A0\033[0m'},
              {'Б1': ' ', 'Д1': ' ', 'Б2': ' ', 'В2': ' ', 'Г2': ' ', 'Д2': ' '}],
             [{'Е6': '\033[34m\u25A0\033[0m', 'Е7': '\033[34m\u25A0\033[0m'},
              {'Д5': ' ', 'Д6': ' ', 'Д7': ' ', 'Д8': ' ', 'Е5': ' ', 'Е8': ' ', 'Ж5': ' ', 'Ж6': ' ', 'Ж7': ' ',
               'Ж8': ' '}]], [[{'А1': '\033[34m\u25A0\033[0m'}, {'Б1': ' ', 'А2': ' ', 'Б2': ' '}],
                              [{'К6': '\033[34m\u25A0\033[0m'},
                               {'И5': ' ', 'К5': ' ', 'И6': ' ', 'И7': ' ', 'К7': ' '}],
                              [{'К10': '\033[34m\u25A0\033[0m'}, {'И9': ' ', 'К9': ' ', 'И10': ' '}],
                              [{'Е1': "Х"},
                               {'Д1': ' ', 'Ж1': ' ', 'Д2': ' ', 'Е2': ' ', 'Ж2': ' '}]]]
#Enemy_key = random.choice(list(fleet[0][0][0].keys()))  # Ship.positions_ships(4).keys())
list_keys = []
for fleet_item in fleet:
    for list_ in fleet_item:
        list_keys = []
        for key_, item_ in list_[0].items():
            list_keys.append(list_[0][key_])
        if '\033[34m\u25A0\033[0m' not in list_keys:
            for key, item in list_[1].items():
                list_[1][key] = "Х"

for i in range(4, 0, -1):
    print(i)
list_keys = []
for fleet_item in fleet:
    for list_ in fleet_item:
        for key_, item_ in list_[0].items():
            list_keys.append(key_)
print(list_keys)
print(fleet[0][0][1])
print(fleet[3][3][1])